# coding: utf-8
import os,sys
import random

##PROVINCE为元组,PROVINCE_DICT为字典
PROVINCE=((0,'unknown'),(1,'北京市'),(2,'上海市'),(3,'天津市'),(4,'重庆市'),(5,'云南省'),(6,'台湾省'),(7,'吉林省'),(8,'四川省'),(9,'安徽省'),(10,'山东省'),(11,'山西省'),(12,'广东省'),(13,'江苏省'),(14,'江西省'),(15,'河北省'),(16,'河南省'),(17,'浙江省'),(18,'海南省'),(19,'湖北省'),(20,'湖南省'),(21,'甘肃省'),(22,'福建省'),(23,'贵州省'),(24,'辽宁省'),(25,'陕西省'),(26,'青海省'),(27,'黑龙江省'),(28,'西藏自治区'),(29,'广西壮族自治区'),(30,'新疆维吾尔自治区'),(31,'宁夏回族自治区'),(32,'内蒙古自治区'),(33,'香港特别行政区'),(34,'澳门特别行政区'))
PROVINCE_DICT = dict(PROVINCE)

CITY= {0:((0,'unknown')),1:((0,'unknown'),(1,'东城区'),(2,'丰台区'),(3,'大兴区'),(4,'宣武区'),(5,'密云县'),(6,'崇文区'),(7,'平谷区'),(8,'延庆县'),(9,'怀柔区'),(10,'房山区'),(11,'昌平区'),(12,'朝阳区'),(13,'海淀区'),(14,'石景山区'),(15,'西城区'),(16,'通州区'),(17,'门头沟区'),(18,'顺义区')),2:((0,'unknown'),(1,'南汇区'),(2,'卢湾区'),(3,'嘉定区'),(4,'奉贤区'),(5,'宝山区'),(6,'崇明县'),(7,'徐汇区'),(8,'普陀区'),(9,'杨浦区'),(10,'松江区'),(11,'浦东新区'),(12,'虹口区'),(13,'金山区'),(14,'长宁区'),(15,'闵行区'),(16,'闸北区'),(17,'青浦区'),(18,'静安区'),(19,'黄浦区')),3:((0,'unknown'),(1,'东丽区'),(2,'北辰区'),(3,'南开区'),(4,'和平区'),(5,'塘沽区'),(6,'大港区'),(7,'宁河县'),(8,'宝坻区'),(9,'武清区'),(10,'汉沽区'),(11,'河东区'),(12,'河北区'),(13,'河西区'),(14,'津南区'),(15,'红桥区'),(16,'西青区'),(17,'静海县')),4:((0,'unknown'),(1,'万州区'),(2,'万盛区'),(3,'丰都县'),(4,'九龙坡区'),(5,'云阳县'),(6,'北碚区'),(7,'南岸区'),(8,'双桥区'),(9,'合川区'),(10,'垫江县'),(11,'城口县'),(12,'壁山'),(13,'大渡口区'),(14,'大足区'),(15,'奉节县'),(16,'巫山县'),(17,'巫溪县'),(18,'巴南区'),(19,'开县'),(20,'忠县'),(21,'梁平县'),(22,'永川区'),(23,'江北区'),(24,'江津区'),(25,'沙坪坝区'),(26,'涪陵区'),(27,'渝中区'),(28,'渝北区'),(29,'潼南县'),(30,'石柱土家族自治县'),(31,'秀山土家族苗族自治县'),(32,'綦江区'),(33,'荣昌县'),(34,'铜梁区'),(35,'长寿区'),(36,'黔江区')),5:((0,'unknown'),(1,'临沧市'),(2,'丽江市'),(3,'保山市'),(4,'大理白族自治州'),(5,'德宏傣族景颇族自治州'),(6,'怒江傈僳族自治州'),(7,'文山壮族苗族自治州'),(8,'昆明市'),(9,'昭通市'),(10,'普洱市'),(11,'曲靖市'),(12,'楚雄彝族自治州'),(13,'玉溪市'),(14,'红河哈尼族彝族自治州'),(15,'西双版纳傣族自治州'),(16,'迪庆藏族自治州')),6:((0,'台湾省')),7:((0,'unknown'),(1,'吉林市'),(2,'四平市'),(3,'延边朝鲜族自治州'),(4,'松原市'),(5,'白城市'),(6,'白山市'),(7,'辽源市'),(8,'通化市'),(9,'长春市')),8:((0,'unknown'),(1,'乐山市'),(2,'内江市'),(3,'凉山彝族自治州'),(4,'南充市'),(5,'宜宾市'),(6,'巴中市'),(7,'广元市'),(8,'广安市'),(9,'德阳市'),(10,'成都市'),(11,'攀枝花市'),(12,'泸州市'),(13,'甘孜藏族自治州'),(14,'眉山市'),(15,'绵阳市'),(16,'自贡市'),(17,'资阳市'),(18,'达州市'),(19,'遂宁市'),(20,'阿坝藏族羌族自治州'),(21,'雅安市')),9:((0,'unknown'),(1,'亳州市'),(2,'六安市'),(3,'合肥市'),(4,'安庆市'),(5,'宣城市'),(6,'宿州市'),(7,'巢湖市'),(8,'池州市'),(9,'淮北市'),(10,'淮南市'),(11,'滁州市'),(12,'芜湖市'),(13,'蚌埠市'),(14,'铜陵市'),(15,'阜阳市'),(16,'马鞍山市'),(17,'黄山市')),10:((0,'unknown'),(1,'东营市'),(2,'临沂市'),(3,'威海市'),(4,'德州市'),(5,'日照市'),(6,'枣庄市'),(7,'泰安市'),(8,'济南市'),(9,'济宁市'),(10,'淄博市'),(11,'滨州市'),(12,'潍坊市'),(13,'烟台市'),(14,'聊城市'),(15,'莱芜市'),(16,'菏泽市'),(17,'青岛市')),11:((0,'unknown'),(1,'临汾市'),(2,'吕梁市'),(3,'大同市'),(4,'太原市'),(5,'忻州市'),(6,'晋中市'),(7,'晋城市'),(8,'朔州市'),(9,'运城市'),(10,'长治市'),(11,'阳泉市')),12:((0,'unknown'),(1,'东莞市'),(2,'中山市'),(3,'云浮市'),(4,'佛山市'),(5,'广州市'),(6,'惠州市'),(7,'揭阳市'),(8,'梅州市'),(9,'汕头市'),(10,'汕尾市'),(11,'江门市'),(12,'河源市'),(13,'深圳市'),(14,'清远市'),(15,'湛江市'),(16,'潮州市'),(17,'珠海市'),(18,'肇庆市'),(19,'茂名市'),(20,'阳江市'),(21,'韶关市')),13:((0,'unknown'),(1,'南京市'),(2,'南通市'),(3,'宿迁市'),(4,'常州市'),(5,'徐州市'),(6,'扬州市'),(7,'无锡市'),(8,'泰州市'),(9,'淮安市'),(10,'盐城市'),(11,'苏州市'),(12,'连云港市'),(13,'镇江市')),14:((0,'unknown'),(1,'上饶市'),(2,'九江市'),(3,'南昌市'),(4,'吉安市'),(5,'宜春市'),(6,'抚州市'),(7,'新余市'),(8,'景德镇市'),(9,'萍乡市'),(10,'赣州市'),(11,'鹰潭市')),15:((0,'unknown'),(1,'保定市'),(2,'唐山市'),(3,'廊坊市'),(4,'张家口市'),(5,'承德市'),(6,'沧州市'),(7,'石家庄市'),(8,'秦皇岛市'),(9,'衡水市'),(10,'邢台市'),(11,'邯郸市')),16:((0,'unknown'),(1,'三门峡市'),(2,'信阳市'),(3,'南阳市'),(4,'周口市'),(5,'商丘市'),(6,'安阳市'),(7,'平顶山市'),(8,'开封市'),(9,'新乡市'),(10,'洛阳市'),(11,'济源市'),(12,'漯河市'),(13,'濮阳市'),(14,'焦作市'),(15,'许昌市'),(16,'郑州市'),(17,'驻马店市'),(18,'鹤壁市')),17:((0,'unknown'),(1,'丽水市'),(2,'台州市'),(3,'嘉兴市'),(4,'宁波市'),(5,'杭州市'),(6,'温州市'),(7,'湖州市'),(8,'绍兴市'),(9,'舟山市'),(10,'衢州市'),(11,'金华市')),18:((0,'unknown'),(1,'万宁市'),(2,'三亚市'),(3,'三沙市'),(4,'东方市'),(5,'临高县'),(6,'乐东黎族自治县'),(7,'五指山市'),(8,'保亭黎族苗族自治县'),(9,'儋州市'),(10,'定安县'),(11,'屯昌县'),(12,'文昌市'),(13,'海口市'),(14,'澄迈县'),(15,'琼中黎族苗族自治县'),(16,'琼海市'),(17,'陵水黎族自治县')),19:((0,'unknown'),(1,'仙桃市'),(2,'十堰市'),(3,'咸宁市'),(4,'天门市'),(5,'孝感市'),(6,'宜昌市'),(7,'恩施土家族苗族自治州'),(8,'武汉市'),(9,'江汉（天门/仙桃/潜江）区'),(10,'潜江市'),(11,'神农架林区'),(12,'荆州市'),(13,'荆门市'),(14,'襄阳市'),(15,'鄂州市'),(16,'随州市'),(17,'黄冈市'),(18,'黄石市')),20:((0,'unknown'),(1,'娄底市'),(2,'岳阳市'),(3,'常德市'),(4,'张家界市'),(5,'怀化市'),(6,'株洲市'),(7,'永州市'),(8,'湘潭市'),(9,'湘西土家族苗族自治州'),(10,'益阳市'),(11,'衡阳市'),(12,'邵阳市'),(13,'郴州市'),(14,'长沙市')),21:((0,'unknown'),(1,'临夏回族自治州'),(2,'兰州市'),(3,'嘉峪关市'),(4,'天水市'),(5,'定西市'),(6,'平凉市'),(7,'庆阳市'),(8,'张掖市'),(9,'武威市'),(10,'甘南藏族自治州'),(11,'白银市'),(12,'酒泉市'),(13,'金昌市'),(14,'陇南市')),22:((0,'unknown'),(1,'三明市'),(2,'南平市'),(3,'厦门市'),(4,'宁德市'),(5,'泉州市'),(6,'漳州市'),(7,'福州市'),(8,'莆田市'),(9,'龙岩市')),23:((0,'unknown'),(1,'六盘水市'),(2,'安顺市'),(3,'毕节市'),(4,'贵阳市'),(5,'遵义市'),(6,'铜仁市'),(7,'黔东南苗族侗族自治州'),(8,'黔南布依族苗族自治州'),(9,'黔西南布依族苗族自治州')),24:((0,'unknown'),(1,'丹东市'),(2,'大连市'),(3,'抚顺市'),(4,'朝阳市'),(5,'本溪市'),(6,'沈阳市'),(7,'盘锦市'),(8,'营口市'),(9,'葫芦岛市'),(10,'辽阳市'),(11,'铁岭市'),(12,'锦州市'),(13,'阜新市'),(14,'鞍山市')),25:((0,'unknown'),(1,'咸阳市'),(2,'商洛市'),(3,'安康市'),(4,'宝鸡市'),(5,'延安市'),(6,'榆林市'),(7,'汉中市'),(8,'渭南市'),(9,'西安市'),(10,'铜川市')),26:((0,'unknown'),(1,'果洛藏族自治州'),(2,'海东市'),(3,'海北藏族自治州'),(4,'海南藏族自治州'),(5,'海西蒙古族藏族自治州'),(6,'玉树藏族自治州'),(7,'西宁市'),(8,'黄南藏族自治州')),27:((0,'unknown'),(1,'七台河市'),(2,'伊春市'),(3,'佳木斯市'),(4,'双鸭山市'),(5,'哈尔滨市'),(6,'大兴安岭地区'),(7,'大庆市'),(8,'牡丹江市'),(9,'绥化市'),(10,'鸡西市'),(11,'鹤岗市'),(12,'黑河市'),(13,'齐齐哈尔市')),28:((0,'unknown'),(1,'山南地区'),(2,'拉萨市'),(3,'日喀则地区'),(4,'昌都地区'),(5,'林芝地区'),(6,'那曲地区'),(7,'阿里地区')),29:((0,'unknown'),(1,'北海市'),(2,'南宁市'),(3,'崇左市'),(4,'来宾市'),(5,'柳州市'),(6,'桂林市'),(7,'梧州市'),(8,'河池市'),(9,'玉林市'),(10,'百色市'),(11,'贵港市'),(12,'贺州市'),(13,'钦州市'),(14,'防城港市')),30:((0,'unknown'),(1,'乌鲁木齐市'),(2,'伊犁哈萨克自治州'),(3,'克孜勒苏柯尔克孜自治州'),(4,'克拉玛依市'),(5,'博尔塔拉蒙古自治州'),(6,'吐鲁番地区'),(7,'和田地区'),(8,'哈密地区'),(9,'喀什地区'),(10,'塔城地区'),(11,'巴音郭楞蒙古自治州'),(12,'昌吉回族自治州'),(13,'石河子市'),(14,'阿克苏地区'),(15,'阿勒泰地区'),(16,'阿拉尔市')),31:((0,'unknown'),(1,'中卫市'),(2,'吴忠市'),(3,'固原市'),(4,'石嘴山市'),(5,'银川市')),32:((0,'unknown'),(1,'乌兰察布市'),(2,'乌海市'),(3,'兴安盟'),(4,'包头市'),(5,'呼伦贝尔市'),(6,'呼和浩特市'),(7,'巴彦淖尔市'),(8,'赤峰市'),(9,'通辽市'),(10,'鄂尔多斯市'),(11,'锡林郭勒盟'),(12,'阿拉善盟')),33:((0,''),(1,'')),34:((0,''),(1,''))}
CITY_DICT = dict(CITY)


# print CITY_DICT[33][0][1]
#OP=((0,'未知'),(1,'电信'),(2,'联通'),(3,'移动'),(4,'教育网'),(5,'BGP多线'),(6,'长宽'),(7,'小运营商'))
OP=((0,'未知'),(1,'电信'),(2,'联通'),(3,'教育网'),(4,'铁通'),(5,'移动'),(6,'长宽'),(7,'广电'),(8,'阿里巴巴'),(9,'城市电讯'),(10,'中国科技网'),(11,'歌华有线'),(12,'电讯盈科'),(13,'腾讯网络'),(14,'京宽网络'),(15,'艾普'),(16,'第一线'),(17,'中信网络'),(18,'和记电讯'),(19,'天威'),(20,'方正宽带'),(21,'互通宽带'),(22,'电信通'),(23,'天地网联'),(24,'中电飞华'),(25,'世纪互联'),(26,'佰隆网络'),(27,'中电华通'),(28,'屹立由数据'),(29,'恒汇'),(30,'e家宽'),(31,'时代互通'),(32,'华数网通'),(33,'北龙中网'),(34,'九仓电讯'),(35,'互联通'),(36,'长城互联网'),(37,'日升天信科技'),(38,'东方有线'),(39,'太平洋电信'),(40,'华瑞信通'),(41,'亚太环通'),(42,'中企通信'),(43,'咨询联网'),(44,'畅捷通信'),(45,'新世界电讯'),(46,'南凌'),(47,'中信泰富'),(48,'香港有线'),(49,'视讯宽带'),(50,'网易网络'),(51,'数码通'),(52,'光环新网'),(53,'视通宽带'),(54,'网联光通'),(55,'网宿科技'),(56,'国研网'),(57,'中国互联网信息中心'),(58,'蓝讯通信技术'),(59,'大学'),(60,'华夏光网'),(61,'龙腾佳讯'),(62,'科盈电讯'),(63,'百度网络'),(64,'新网络'),(65,'新网'),(66,'数讯信息技术'),(67,'恒通国际'),(68,'天地通电信'),(69,'地面通信息网络'),(70,'首信网'),(71,'铜牛集团'),(72,'维赛网络'),(73,'百吉数据'),(74,'燕大正洋'),(75,'有孚网络'),(76,'新飞金信'),(77,'南凌科技'),(78,'上海信息网络'),(79,'金桥网'),(80,'翰威科技'),(81,'经济信息网'),(82,'景安计算机网络'),(83,'平煤神马集团'),(84,'安徽省教育厅'),(85,'好维高科'),(86,'壹通通信'),(87,'城市网络'),(88,'中国在线'),(89,'中国国际电子商务中心'),(90,'零色沸点网络'),(91,'零刻数据'),(92,'紫田网络'),(93,'新电'),(94,'广东盈通'),(95,'华宇宽带'),(96,'临网通讯'),(97,'中科鸿基网络'),(98,'飞华领航'),(99,'金科信息网'),(100,'视虎科技'),(101,'盛大网络'),(102,'润迅通信'),(103,'润科通信'),(104,'油田宽带'),(105,'杭州华数'),(106,'小运营商'),(107,'新视讯'),(108,'新浪网络'),(109,'新力讯'),(110,'天津广电'),(111,'国安创想通信'),(112,'和记'),(113,'同煤集团'),(114,'可口可乐网络'),(115,'中国一汽'),(116,'宽频'),(117,'BGP多线'))

def get_code(province,dict,op):
	###获取省编码
	for key in PROVINCE_DICT:
		if(PROVINCE_DICT[key]==province):
			province_code=key
			break
		else:
			province_code=0
	###获得地市编码
	if(province_code==0):
		dict_code=0
	##只含有省级信息的，其地市信息为0
	elif(dict=='sheng_null'):
		dict_code=0
	##直辖市的区域信息为随机
	elif(province_code==1):
		dict_code=random.randint(1,18)
	elif(province_code==2):
		dict_code=random.randint(1,19)
	elif(province_code==3):
		dict_code=random.randint(1,17)
	elif(province_code==4):
		dict_code=random.randint(1,36)
	else:
		temp_dict=CITY_DICT[province_code]
		for i in temp_dict:
			if(dict==i[1]):
				dict_code=i[0]
				break
			else:
				dict_code=0
	###获取运营商编码
	for i in OP:
		if(i[1]==op):
			op_code=i[0]
			break
		else:
			op_code=0
	return op_code,province_code,dict_code
	
if __name__=='__main__':
	print get_code(sys.argv[1],sys.argv[2],sys.argv[3])
